---
type: ParameterFilterElement
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# ParameterFilterElement

`Autodesk.Revit.DB.ParameterFilterElement` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AllRuleParametersApplicable | — | `` |
| Method | ClearRules | 2011 | `public void ClearRules ()` |
| Method | Create | — | `` |
| Method | ElementFilterIsAcceptableForParameterFilterElement | — | `` |
| Method | GetCategories | 2011 | `public ICollection < ElementId > GetCategories ()` |
| Method | GetElementFilter | 2019 | `public ElementFilter GetElementFilter ()` |
| Method | GetElementFilterParameters | 2019 | `public ISet < ElementId > GetElementFilterParameters ()` |
| Method | GetElementFilterParametersForCategory | 2020 | `public ISet < ElementId > GetElementFilterParametersForCategory ( ElementId categoryId )` |
| Method | SetCategories | 2011 | `public void SetCategories ( ICollection < ElementId > categories )` |
| Method | SetElementFilter | 2019 | `public bool SetElementFilter ( ElementFilter elementFilter )` |
| Property | Parameter | — | `` |